//GPFPB006 JOB 'GPFPB006',CLASS=A,MSGCLASS=X
//*
//STEP1   EXEC PGM=GPFPB006
//*CADPECA DD DUMMY
//CADPECA DD DSN=AD.CADPECA.DAT,DISP=SHR
//CADPRES DD DSN=AD.CADPRES.DAT,DISP=OLD,
//           SPACE=(TRK,(1,1),RLSE),UNIT=DISCO,
//           DCB=(LRECL=100,RECFM=FB,DSORG=PS)
//SYSOUT DD SYSOUT=*
//*
