//GPFPB015 JOB GPFPB015,CLASS=A,MSGCLASS=X
//*
//STEP1   EXEC PGM=GPFPB015
//*CADPECA DD DUMMY
//CADPECA DD DSN=AD.CADPECA.DAT,DISP=SHR
//CADPREL DD SYSOUT=*
//*CADPREL DD DSN=AD.CADPREL.DAT,DISP=OLD,
//*           SPACE=(TRK,(1,1),RLSE),UNIT=DISCO,
//*           DCB=(LRECL=133,RECFM=FB,DSORG=PS)
//SYSOUT DD SYSOUT=*
//*
