//GPFPB012 JOB GPFPB012,CLASS=A,MSGCLASS=X
//*
//STEP1   EXEC PGM=GPFPB012
//CADFIL1 DD DSN=AD.CADFIL1.DAT,DISP=SHR
//*CADFIL1 DD DUMMY
//CADFIL2 DD DSN=AD.CADFIL2.DAT,DISP=SHR
//*CADFIL2 DD DUMMY
//CADFIL3 DD DSN=AD.CADFIL3.DAT,DISP=SHR
//*CADFIL3 DD DUMMY
//CADMATR DD DSN=AD.CADMATR.DAT,DISP=OLD,
//           SPACE=(TRK,(1,1),RLSE),UNIT=DISCO,
//           DCB=(LRECL=100,RECFM=FB,DSORG=PS)
//SYSOUT DD SYSOUT=*
//*
