//GPFPB009 JOB GPFPB009,CLASS=A,MSGCLASS=X
//*
//STEP1   EXEC PGM=GPFPB009
//*CADPECA DD DUMMY
//CADPECA DD DSN=AD.CADPECA.DAT,DISP=SHR
//CADRESP DD DSN=AD.CADRESP.DAT,DISP=OLD,
//           SPACE=(TRK,(1,1),RLSE),UNIT=DISCO,
//           DCB=(LRECL=050,RECFM=FB,DSORG=PS)
//SYSOUT DD SYSOUT=*
//*
