//GPFPB017 JOB GPFPB017,CLASS=A,MSGCLASS=X
//*
//STEP1   EXEC PGM=GPFPB017
//CADCONT DD DSN=AD.CADCONT.DAT,DISP=SHR
//CADCMOV DD DSN=AD.CADCMOV.DAT,DISP=SHR
//CADCATU DD DSN=AD.CADCATU.DAT,DISP=SHR
//CADMREJ DD DSN=AD.CADMREJ.DAT,DISP=SHR
//CADCREL DD DSN=AD.CADCREL.DAT,DISP=OLD,
//           SPACE=(TRK,(1,1),RLSE),UNIT=DISCO,
//           DCB=(LRECL=133,RECFM=FB,DSORG=PS)
//SYSOUT DD SYSOUT=*
//*
