//GPFPB018 JOB 'GPFPB018',CLASS=A,MSGCLASS=X
//*
//STEP1   EXEC PGM=GPFPB018
//CADPECA DD DSN=AD.CADPECA.DAT,DISP=SHR
//*CADPECA DD DUMMY
//CADPATU DD DSN=AD.CADPATU.DAT,DISP=OLD,
//           SPACE=(TRK,(1,1),RLSE),UNIT=DISCO,
//           DCB=(LRECL=100,RECFM=FB,DSORG=PS)
//SYSOUT DD SYSOUT=*
//*
