//GPFPB004 JOB 'GPFPB004',CLASS=A,MSGCLASS=X
//*
//STEP1   EXEC PGM=GPFPB004
//*CADPECA DD DUMMY
//CADPECA DD DSN=AD.CADPECA.DAT,DISP=SHR
//CADPSEL DD DSN=AD.CADPSEL.DAT,DISP=OLD,
//           SPACE=(TRK,(1,1),RLSE),UNIT=DISCO,
//           DCB=(LRECL=100,RECFM=FB,DSORG=PS)
//SYSOUT  DD SYSOUT=*
//*
