//GPFPB007 JOB 'GPFPB007',CLASS=A,MSGCLASS=X
//*
//STEP1   EXEC PGM=GPFPB007
//CADCOTA DD DSN=AD.CADCOTA.DAT,DISP=SHR
//CADCOTD DD DSN=AD.CADCOTD.DAT,DISP=OLD,
//           SPACE=(TRK,(1,1),RLSE),UNIT=DISCO,
//           DCB=(LRECL=100,RECFM=FB,DSORG=PS)
//CADCOTS DD DSN=AD.CADCOTS.DAT,DISP=OLD,
//           SPACE=(TRK,(1,1),RLSE),UNIT=DISCO,
//           DCB=(LRECL=100,RECFM=FB,DSORG=PS)
//SYSOUT DD SYSOUT=*
//*
