//GPFPB011 JOB GPFPB011,CLASS=A,MSGCLASS=X
//*
//STEP1   EXEC PGM=GPFPB011
//*CADFIL1 DD DUMMY
//*CADFIL2 DD DUMMY
//CADFIL1 DD DSN=AD.CADFIL1.DAT,DISP=SHR
//CADFIL2 DD DSN=AD.CADFIL2.DAT,DISP=SHR
//CADMATR DD DSN=AD.CADMATR.DAT,DISP=OLD,
//           SPACE=(TRK,(1,1),RLSE),UNIT=DISCO,
//           DCB=(LRECL=100,RECFM=FB,DSORG=PS)
//SYSOUT DD SYSOUT=*
//*
