//GPFPB021 JOB 'GPFPB021',CLASS=A,MSGCLASS=X
//*
//STEP1   EXEC PGM=GPFPB021
//*E1PQEX22 DD DUMMY
//*E2UQEX22 DD DUMMY
//E1PQEX22 DD DSN=AD.E1PQEX22.DAT,DISP=SHR
//E2UQEX22 DD DSN=AD.E2UQEX22.DAT,DISP=SHR
//S1LQEX22 DD DSN=AD.S1LQEX22.DAT,DISP=SHR
//S2UQEX22 DD DSN=AD.S2UQEX22.DAT,DISP=OLD,
//           SPACE=(TRK,(1,1),RLSE),UNIT=DISCO,
//           DCB=(LRECL=100,RECFM=FB,DSORG=PS)
//SYSOUT DD SYSOUT=*
//*
