//GPFPB014 JOB GPFPB014,CLASS=A,MSGCLASS=X
//*
//STEP1   EXEC PGM=GPFPB014,PARM='20140506'
//*CADPMOV DD DUMMY
//CADPMOV DD DSN=AD.CADPMOV.DAT,DISP=SHR
//CADMOVA DD DSN=AD.CADMOVA.DAT,DISP=SHR
//CADMOVR DD DSN=AD.CADMOVR.DAT,DISP=OLD,
//           SPACE=(TRK,(1,1),RLSE),UNIT=DISCO,
//           DCB=(LRECL=050,RECFM=FB,DSORG=PS)
//SYSOUT DD SYSOUT=*
//*
