//GPFPB013 JOB GPFPB013,CLASS=A,MSGCLASS=X
//*
//STEP1   EXEC PGM=GPFPB013
//*CADFUNC DD DUMMY
//CADFUNC DD DSN=AD.CADFUNC.DAT,DISP=OLD
//*MOVFUNC DD DUMMY
//MOVFUNC DD DSN=AD.MOVFUNC.DAT,DISP=OLD
//CADFATU DD DSN=AD.CADFATU.DAT,DISP=OLD
//CADFLOG DD DSN=AD.CADFLOG.DAT,DISP=OLD,
//           SPACE=(TRK,(1,1),RLSE),UNIT=DISCO,
//           DCB=(LRECL=100,RECFM=FB,DSORG=PS)
//SYSOUT DD SYSOUT=*
//*
